app/controllers/books_controller.rb

SELECT "books".* FROM "books"
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "aa"], ["body", "aaaa"], ["created_at", "2017-11-13 11:34:09.372607"], ["updated_at", "2017-11-13 11:34:09.372607"]]
---
  def create
  	@books = Book.all
  	@book = Book.new(book_params)

  	if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "アイウエオ"], ["updated_at", "2017-11-14 07:05:55.909767"], ["id", 6]]
---
  def update
  	@book = Book.find(params[:id])
  	@book.update(book_params)